## Linear Regression Assignment

#### 1. Load the dataset using pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
pwd

'C:\\Users\\megik'

In [3]:
df=pd.read_csv('C:\\Users\\megik\\downloads\\data.csv')

In [6]:
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 608.0 bytes

In [8]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

#### 2.Extract data fromYearsExperience column is a variable named X

In [10]:
x=df[['YearsExperience']]
x
# x=np.array(x).reshape(1,-1)

    YearsExperience
0               1.1
1               1.3
2               1.5
3               2.0
4               2.2
5               2.9
6               3.0
7               3.2
8               3.2
9               3.7
10              3.9
11              4.0
12              4.0
13              4.1
14              4.5
15              4.9
16              5.1
17              5.3
18              5.9
19              6.0
20              6.8
21              7.1
22              7.9
23              8.2
24              8.7
25              9.0
26              9.5
27              9.6
28             10.3
29             10.5

#### 3.Extract data from salary column is a variable named Y

In [11]:
y=df[['Salary']]
y

      Salary
0    39343.0
1    46205.0
2    37731.0
3    43525.0
4    39891.0
5    56642.0
6    60150.0
7    54445.0
8    64445.0
9    57189.0
10   63218.0
11   55794.0
12   56957.0
13   57081.0
14   61111.0
15   67938.0
16   66029.0
17   83088.0
18   81363.0
19   93940.0
20   91738.0
21   98273.0
22  101302.0
23  113812.0
24  109431.0
25  105582.0
26  116969.0
27  112635.0
28  122391.0
29  121872.0

#### 4.Divide the dataset into two parts for training and testing in 66% and 33% proportion

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.33)

In [14]:
print(x_train)

    YearsExperience
17              5.3
24              8.7
0               1.1
15              4.9
18              5.9
11              4.0
26              9.5
16              5.1
22              7.9
6               3.0
8               3.2
12              4.0
23              8.2
9               3.7
19              6.0
29             10.5
25              9.0
21              7.1
20              6.8
28             10.3

In [15]:
print(x_test)

    YearsExperience
7               3.2
4               2.2
10              3.9
3               2.0
5               2.9
2               1.5
14              4.5
27              9.6
1               1.3
13              4.1

In [16]:
len(x_train)

20

In [17]:
len(x_test)

10

#### 5.Create and train LinearRegression Model on training set

In [18]:
from sklearn.linear_model import LinearRegression

In [19]:
model=LinearRegression()

In [20]:
model.fit(x_train,y_train)

LinearRegression()

In [21]:
model.coef_

array([[9379.94675985]])

In [22]:
model.intercept_

array([27130.83062134])

#### 6.Make predictions based on the testing set using the trained model

In [23]:
predict=model.predict(x_test)

In [24]:
y_test

      Salary
7    54445.0
4    39891.0
10   63218.0
3    43525.0
5    56642.0
2    37731.0
14   61111.0
27  112635.0
1    46205.0
13   57081.0

#### 7.Check the performance by calculating the r2 score of the model

In [25]:
from sklearn.metrics import r2_score

In [26]:
r2_score(y_test,predict)

0.9270149027214223